<?php
namespace Cyinf;

class DepartmentParser
{
    static private $department_map = [
			0 =>'國語文',
			1 =>'英文初級',
			2 =>'英文中級',
			3 =>'英文中高級',
			4 =>'英文高級',
			5 =>'運動與健康',
			6 =>'興趣選修',
			7 =>'通識教育',
			8 =>'應用性課程',
			9 =>'普通物理小組',
			10 => '跨院（通）',
			11 => '跨院（文）',
			12 => '跨院（理）',
			13 => '跨院（工）',
			14 => '跨院（管）',
			15 => '跨院（海）',
			16 => '跨院（社）',
			17 => '服務學習',
			18 => '中文系（CL）',
			19 => '外文系（DFLL）',
			20 => '文學院（LIBA）',
			21 => '音樂系（MUSI）',
			22 => '哲學碩（PHIL）',
			23 => '劇藝系（TA）',
			24 => '生科系（BIOS）',
			25 => '生醫碩（IMBS）',
			26 => '化學系（CHE）',
			27 => '物理系（PHYS）',
			28 => '應數系（MATH）',
			29 => '電機系（EE）',
			30 => '電力碩（IMPE）',
			31 => '通訊碩（ICE）',
			32 => '機電系（MEME）',
			33 => '資工系（CSE）',
			34 => '光電系（EO）',
			35 => '材光系（MOES）',
			36 => '環工碩（ENVE）',
			37 => '企管系（BM）',
			38 => '資管系（MIS）',
			39 => '財管系（FM）',
			40 => '人管所（HRM）',
			41 => '傳管所（ICM）',
			42 => '政經系（PE）',
			43 => '公事碩（PAM）',
			44 => '政治碩（IPS）',
			45 => '經濟碩（ECON）',
			46 => '社會系（SOC）',
			47 => '教育碩（IOE）',
			48 => '亞太碩（CAPS）',
			49 => '社科院（CSS）',
			50 => '海工系（MAEV）',
			51 => '海資系（MBR）',
			52 => '（MRBI）',
			53 => '海地化碩（IMGC）',
			54 => '海事碩（MA）',
			55 => '海下物碩（UTAO）',
			56 => 'BPM',
			57 => 'STP',
			58 => '醫管學程（IHCM）',
			59 => 'IB',
            60 => '海科系（OO）'
    ];

    static public function parse( $department_code )
    {
        return self::$department_map[ $department_code ];
    }
}